uhnp/src/InformationRegisters/ИсключенияУчетнойПолитики/ИсключенияУчетнойПолитики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсключенияУчетнойПолитики</name>
  <resources>
    <name>ЗначениеИсключения</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяПолитика</name>
    <type>
      <types>DocumentRef.УчетнаяПолитикаМСФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделУчета</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементУчетнойПолитики</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ИсключенияУчетнойПолитики/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОграничениеТипов();
КонецПроцедуры

&НаКлиенте
Процедура РазделУчетаПриИзменении(Элемент)
	УстановитьОграничениеТипов();
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеТипов()
	
	ОграничениеТипов = Новый Массив;
	Если Запись.РазделУчета.ЗначениеПустойСсылки = Неопределено Тогда
		
		ОграничениеТипов.Добавить(Тип("СправочникСсылка.СчетаБД"));
		
		ПараметрыВыбораИсточник = Новый Массив;
		ПараметрыВыбораИсточник.Добавить(Новый ПараметрВыбора("Владелец", Запись.УчетнаяПолитика.ПланСчетовУчета));
		ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораИсточник);
		
	Иначе 
		
		ОграничениеТипов.Добавить(ТипЗнч(Запись.РазделУчета.ЗначениеПустойСсылки));
		ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
		
	КонецЕсли;
	
	Элементы.ЭлементУчетнойПолитики.ОграничениеТипа = Новый ОписаниеТипов(ОграничениеТипов);
	Элементы.ЭлементУчетнойПолитики.ПараметрыВыбора = ПараметрыВыбора;
	
	Элементы.ЗначениеИсключения.ОграничениеТипа = Элементы.ЭлементУчетнойПолитики.ОграничениеТипа;
	Элементы.ЗначениеИсключения.ПараметрыВыбора = ПараметрыВыбора;
	
КонецПроцедуры
